org/我要重学C++.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2020-12-04 Fri>
#+TITLE: 我要重学C++

* 前言
  从大一到大三，我前前后后看了几本有关C++的书，有电子书，有实体书，但是都没有涉及到C++的核心/高级部分。
  而最近我对TUI程序有些感兴趣，考虑了好多语言，最终决定使用C++，原因有如下几点:
  1. 曾经写过C++，最基本的语法还记得。
  2. 以后简历上可以写用C++做个项目
  3. C++的生态和语法的复杂性对我来说是个挑战，我喜欢挑战。

  在找准C++这门语言后，我就看了下ncurses库，写过一些小例子，但是觉得有些太罗嗦了，而且写出的程序跟教程不符，且市面上的教程很多都是过时的。后来我又找到了一个框架————[[https://github.com/gansm/finalcut][finalcut]] ，看到还在活跃开发，便决定使用它了。但是当我在根据它的示例代码学习时发现了很多C++ 11的语法，且有很多C++ 模板的内容，这些内容我早记不太清了，所以必须得复习C++了。

  那么就开干把，希望我从现在到寒假结束能写出几个自己想要的Text Based Program！
  
  
