public/我要重学C++.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-01 Thu 15:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>我要重学C++</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">我要重学C++</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org698988d">前言</a></li>
</ul>
</div>
</div>

<div id="outline-container-org698988d" class="outline-2">
<h2 id="org698988d">前言</h2>
<div class="outline-text-2" id="text-org698988d">
<p>
从大一到大三，我前前后后看了几本有关C++的书，有电子书，有实体书，但是都没有涉及到C++的核心/高级部分。
而最近我对TUI程序有些感兴趣，考虑了好多语言，最终决定使用C++，原因有如下几点:
</p>
<ol class="org-ol">
<li>曾经写过C++，最基本的语法还记得。</li>
<li>以后简历上可以写用C++做个项目</li>
<li>C++的生态和语法的复杂性对我来说是个挑战，我喜欢挑战。</li>
</ol>

<p>
在找准C++这门语言后，我就看了下ncurses库，写过一些小例子，但是觉得有些太罗嗦了，而且写出的程序跟教程不符，且市面上的教程很多都是过时的。后来我又找到了一个框架————<a href="https://github.com/gansm/finalcut">finalcut</a> ，看到还在活跃开发，便决定使用它了。但是当我在根据它的示例代码学习时发现了很多C++ 11的语法，且有很多C++ 模板的内容，这些内容我早记不太清了，所以必须得复习C++了。
</p>

<p>
那么就开干把，希望我从现在到寒假结束能写出几个自己想要的Text Based Program！
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-12-04 Fri 00:00</p>
<p class="author">Author: Evan Meek</p>
<p class="date">Created: 2021-04-01 Thu 15:12</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
